In [1]:
import pandas as pd

In [13]:
# code to read the csv file having extra heading.
df = pd.read_csv('data_folder/tickets.csv', skiprows=1)

# same thing we can get from header argument.
df = pd.read_csv('data_folder/tickets.csv', header=1)

In [14]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [20]:
df = pd.read_csv('data_folder/stock.csv', header=None)

In [21]:
df

       0              1    2     3              4
0  GOOGL          27.82   87   845     larry page
1    WMT           4.61  484    65           n.a.
2   MSFT             -1   85    64     bill gates
3    RIL  not available   50  1023  mukesh ambani
4   TATA            5.6   -1  n.a.     ratan tata

In [24]:
# code to read csv without header in csv files with custom header
df = pd.read_csv('data_folder/stock.csv', header=None, names=['Ticker', 'eps', 'revenue', 'price', 'people'])

In [25]:
df

  Ticker            eps  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65           n.a.
2   MSFT             -1       85    64     bill gates
3    RIL  not available       50  1023  mukesh ambani
4   TATA            5.6       -1  n.a.     ratan tata

In [28]:
# code to read only three rows from csv
df = pd.read_csv('data_folder/tickets.csv', header=1, nrows=3)

In [27]:
df

    WMT           4.61  484    65           n.a.
0  MSFT             -1   85    64     bill gates
1   RIL  not available   50  1023  mukesh ambani
2  TATA            5.6   -1  n.a.     ratan tata